{
    "examples": [
        {
            "word": "involved",
            "examples": [
                {
                    "english": "The theoretical framework of quantum mechanics is so involved that even seasoned physicists often struggle to fully grasp its implications.",
                    "persian": "چارچوب نظری مکانیک کوانتومی آنقدر پیچیده است که حتی فیزیکدانان باتجربه نیز اغلب در درک کامل پیامدهای آن دچار مشکل می‌شوند.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-06 00:12:44"
                },
                {
                    "english": "Her explanation of the geopolitical dynamics in the region was so involved that it left the audience more perplexed than enlightened.",
                    "persian": "توضیحات او درباره دینامیک‌های ژئوپلیتیک منطقه آنقدر پیچیده بود که مخاطبان را بیشتر سردرگم کرد تا روشنگر.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-01-28 23:59:12"
                },
                {
                    "english": "The legal jargon in the contract was so involved that it required a team of specialized lawyers to decipher its true meaning.",
                    "persian": "اصطلاحات حقوقی به کار رفته در قرارداد آنقدر پیچیده بود که برای رمزگشایی معنای واقعی آن به تیمی از وکلای متخصص نیاز بود.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-02-04 11:49:06"
                },
                {
                    "english": "The plot of the novel is so intricately involved that readers often find themselves rereading entire chapters to piece together the narrative.",
                    "persian": "طرح رمان آنقدر به طور پیچیده‌ای درهم تنیده است که خوانندگان اغلب مجبور می‌شوند فصل‌های کامل را دوباره بخوانند تا بتوانند روایت را کنار هم بچینند.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-01-31 22:07:37"
                },
                {
                    "english": "The mathematical proof was so involved that even the professor admitted it would take weeks of dedicated study to fully comprehend its nuances.",
                    "persian": "اثبات ریاضی آنقدر پیچیده بود که حتی استاد اعتراف کرد که برای درک کامل ظرایف آن به هفته‌ها مطالعه دقیق نیاز است.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-04 15:54:02"
                }
            ]
        },
        {
            "word": "expansive",
            "examples": [
                {
                    "english": "The professor delivered an expansive lecture on the history of ancient civilizations, covering not only political developments but also cultural and philosophical shifts.",
                    "persian": "استاد یک سخنرانی گسترده درباره تاریخ تمدن‌های باستانی ارائه داد که نه تنها تحولات سیاسی، بلکه تغییرات فرهنگی و فلسفی را نیز پوشش می‌داد.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-01-28 23:52:44"
                },
                {
                    "english": "Her expansive knowledge of classical literature allowed her to draw connections between seemingly unrelated works from different eras.",
                    "persian": "دانش گسترده او از ادبیات کلاسیک به او این امکان را داد که بین آثار به ظاهر نامرتبط از دوره‌های مختلف ارتباط برقرار کند.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-05 23:16:31"
                },
                {
                    "english": "After a few glasses of wine, he became unusually expansive, sharing intimate details about his life that he normally kept private.",
                    "persian": "بعد از چند لیوان شراب، او به طور غیرمعمول گشاده‌رو شد و جزئیات صمیمی درباره زندگی‌اش را به اشتراک گذاشت که معمولاً آنها را خصوصی نگه می‌داشت.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-01-29 22:57:54"
                },
                {
                    "english": "The CEO’s expansive vision for the company included not only financial growth but also a commitment to sustainability and social responsibility.",
                    "persian": "چشم‌انداز گسترده مدیرعامل برای شرکت نه تنها شامل رشد مالی، بلکه تعهد به پایداری و مسئولیت اجتماعی نیز می‌شد.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-01 17:26:28"
                },
                {
                    "english": "The novel’s expansive narrative spans three generations, exploring the intricate relationships and evolving identities of its characters.",
                    "persian": "روایت گسترده رمان سه نسل را در بر می‌گیرد و به بررسی روابط پیچیده و هویت‌های در حال تحول شخصیت‌هایش می‌پردازد.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-06 00:13:56"
                }
            ]
        },
        {
            "word": "moment",
            "examples": [
                {
                    "english": "The signing of the peace treaty marked a moment in history that would reshape the geopolitical landscape for decades to come.",
                    "persian": "امضای پیمان صلح لحظه‌ای در تاریخ را رقم زد که برای دهه‌های آینده چهره ژئوپلیتیک جهان را تغییر می‌داد.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-06 00:22:27"
                },
                {
                    "english": "Her discovery of the ancient manuscript was a moment of profound significance, shedding new light on the cultural practices of a lost civilization.",
                    "persian": "کشف او از دست‌نوشته‌ی باستانی لحظه‌ای با اهمیت فراوان بود که نگاهی جدید به شیوه‌های فرهنگی یک تمدن گمشده انداخت.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-02-04 12:23:18"
                },
                {
                    "english": "The scientist described the breakthrough as a moment that could redefine our understanding of the universe and our place within it.",
                    "persian": "دانشمند این دستاورد را لحظه‌ای توصیف کرد که می‌تواند درک ما از جهان و جایگاهمان در آن را بازتعریف کند.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-05 23:00:06"
                },
                {
                    "english": "For the small community, the opening of the new hospital was not just an event but a moment that symbolized hope and progress.",
                    "persian": "برای جامعه کوچک، افتتاح بیمارستان جدید تنها یک رویداد نبود، بلکه لحظه‌ای بود که نماد امید و پیشرفت به شمار می‌رفت.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-01-31 18:49:46"
                },
                {
                    "english": "The artist considered the completion of her masterpiece a moment of both personal and artistic triumph, one that would define her legacy.",
                    "persian": "هنرمند تکمیل شاهکارش را لحظه‌ای از پیروزی هم شخصی و هم هنری می‌دانست که میراث او را تعریف می‌کرد.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-01-28 23:55:02"
                }
            ]
        },
        {
            "word": "base",
            "examples": [
                {
                    "english": "The dictator's base actions, including the suppression of dissent and exploitation of the vulnerable, revealed a complete disregard for ethical principles.",
                    "persian": "اقدامات پست دیکتاتور، از جمله سرکوب مخالفان و بهره‌کشی از آسیب‌پذیران، بی‌اعتنایی کامل به اصول اخلاقی را نشان می‌داد.",
                    "difficulty": 3,
                    "last_time_reviewed": "2025-02-05 22:56:51"
                },
                {
                    "english": "The scandal exposed the base motives of the corporation, which prioritized profit over the well-being of its employees and the environment.",
                    "persian": "رسوایی، انگیزه‌های پست شرکت را آشکار کرد که سود را بر رفاه کارکنان و محیط زیست ترجیح می‌داد.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-01 08:27:37"
                },
                {
                    "english": "His base behavior, such as manipulating others for personal gain, alienated even his closest allies.",
                    "persian": "رفتار پست او، مانند دستکاری دیگران برای منافع شخصی، حتی نزدیک‌ترین متحدانش را از او دور کرد.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-06 00:17:26"
                },
                {
                    "english": "The novel's antagonist is portrayed as a base character, driven solely by greed and a lust for power, with no regard for morality.",
                    "persian": "شخصیت منفی رمان به عنوان فردی پست به تصویر کشیده شده است که تنها با حرص و ولع برای قدرت هدایت می‌شود و هیچ توجهی به اخلاقیات ندارد.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-02-04 11:46:47"
                },
                {
                    "english": "The journalist's exposé revealed the base corruption at the heart of the political system, shocking the public and sparking widespread outrage.",
                    "persian": "افشاگری روزنامه‌نگار، فساد پست در قلب سیستم سیاسی را آشکار کرد و باعث شوک عمومی و خشم گسترده شد.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-01-29 23:27:34"
                }
            ]
        },
        {
            "word": "imbibe",
            "examples": [
                {
                    "english": "During her year abroad, she had the opportunity to imbibe the rich cultural traditions of the region, from its ancient rituals to its contemporary art forms.",
                    "persian": "در طول سالی که در خارج از کشور گذراند، این فرصت را داشت که سنت‌های فرهنگی غنی منطقه را، از آیین‌های باستانی تا فرم‌های هنری معاصر، در خود جذب کند.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-04 11:48:18"
                },
                {
                    "english": "The young philosopher spent hours in the library, imbibing the works of great thinkers and synthesizing their ideas into his own unique perspective.",
                    "persian": "فیلسوف جوان ساعت‌ها در کتابخانه سپری کرد و آثار اندیشمندان بزرگ را در خود جذب کرد و ایده‌های آن‌ها را در قالب دیدگاه منحصر به فرد خود ترکیب نمود.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-06 00:14:48"
                },
                {
                    "english": "The lush landscapes of the countryside seemed to imbibe the golden hues of the setting sun, creating a scene of unparalleled beauty.",
                    "persian": "مناظر سرسبز حومه شهر به نظر می‌رسید که رنگ‌های طلایی غروب خورشید را در خود جذب کرده‌اند و صحنه‌ای از زیبایی بی‌نظیر خلق کرده‌اند.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-01-29 11:54:10"
                },
                {
                    "english": "As a child, he would sit by his grandfather’s side, imbibing stories of bravery and wisdom that would later shape his own values and aspirations.",
                    "persian": "در کودکی، کنار پدربزرگش می‌نشست و داستان‌های شجاعت و خرد را در خود جذب می‌کرد که بعدها ارزش‌ها و آرمان‌های خودش را شکل داد.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-02 14:02:17"
                },
                {
                    "english": "The artist’s work reflects her ability to imbibe the essence of her surroundings, transforming the mundane into something extraordinary.",
                    "persian": "آثار این هنرمند بازتاب توانایی او در جذب جوهره محیط اطرافش است و چیزهای پیش‌پاافتاده را به چیزی فوق‌العاده تبدیل می‌کند.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-05 22:46:46"
                }
            ]
        },
        {
            "word": "inundate",
            "examples": [
                {
                    "english": "After the publication of her groundbreaking research, the scientist was inundated with requests for interviews, collaborations, and speaking engagements.",
                    "persian": "پس از انتشار پژوهش انقلابی‌اش، دانشمند با درخواست‌های مصاحبه، همکاری‌ها و دعوت‌نامه‌های سخنرانی مواجه شد.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-04 11:47:07"
                },
                {
                    "english": "The small customer service team was completely inundated with complaints following the product launch, overwhelming their capacity to respond promptly.",
                    "perslation": "تیم کوچک خدمات مشتریان پس از عرضه محصول، کاملاً تحت فشار شکایت‌ها قرار گرفت و توانایی آن‌ها برای پاسخگویی به موقع را تحت الشعاع قرار داد.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-01-28 23:52:32"
                },
                {
                    "english": "Social media platforms are often inundated with misinformation during times of crisis, making it difficult for users to discern fact from fiction.",
                    "persian": "پلتفرم‌های رسانه‌های اجتماعی اغلب در زمان بحران‌ها با اطلاعات نادرست مواجه می‌شوند، و این کار را برای کاربران سخت می‌کند که واقعیت را از دروغ تشخیص دهند.",
                    "difficulty": 2,
                    "last_time_reviewed": "2025-01-31 16:20:19"
                },
                {
                    "english": "The coastal town was inundated by floodwaters after days of relentless rainfall, forcing residents to evacuate and seek shelter elsewhere.",
                    "persian": "شهر ساحلی پس از روزها باران بی‌امان، با سیلاب‌ها مواجه شد و ساکنان را مجبور به تخلیه و پناه‌گرفتن در جای دیگری کرد.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-06 00:12:08"
                },
                {
                    "english": "The author’s inbox was inundated with fan mail after the release of her latest novel, a testament to the book’s widespread popularity and impact.",
                    "persian": "صندوق ورودی نویسنده پس از انتشار آخرین رمانش، با نامه‌های طرفداران مواجه شد که نشان‌دهنده محبوبیت و تأثیر گسترده کتاب بود.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-01-29 22:50:11"
                }
            ]
        },
        {
            "word": "scintillating",
            "examples": [
                {
                    "english": "The guest speaker delivered a scintillating lecture on the intersection of art and technology, leaving the audience both inspired and intellectually stimulated.",
                    "persian": "سخنران مهمان یک سخنرانی درخشان درباره تقاطع هنر و فناوری ارائه داد که مخاطبان را هم الهام‌بخشید و هم از نظر فکری برانگیخت.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-01-28 23:50:16"
                },
                {
                    "english": "Her scintillating wit and sharp humor made her the life of the party, effortlessly captivating everyone in the room.",
                    "persian": "طنز درخشان و شوخ‌طبعی تیز او باعث شد که مرکز توجه مهمانی باشد و به راحتی همه حاضرین در اتاق را مجذوب خود کند.",
                    "difficulty": 2,
                    "last_time_reviewed": "2025-01-27 03:01:25"
                },
                {
                    "english": "The novel’s scintillating prose and intricate plot twists kept readers on the edge of their seats until the very last page.",
                    "persian": "نثر درخشان و پیچ‌و‌تاب‌های پیچیده داستانی رمان، خوانندگان را تا آخرین صفحه در حالت هیجان نگه داشت.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-06 00:16:17"
                },
                {
                    "english": "The debate was a scintillating exchange of ideas, with each participant presenting compelling arguments that challenged conventional thinking.",
                    "persian": "مناظره یک تبادل درخشان ایده‌ها بود که در آن هر شرکت‌کننده استدلال‌های قانع‌کننده‌ای ارائه داد که تفکر مرسوم را به چالش می‌کشید.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-06 00:20:52"
                },
                {
                    "english": "The orchestra’s scintillating performance of the symphony left the audience in awe, with its dynamic range and emotional depth.",
                    "persian": "اجرای درخشان ارکستر از سمفونی، مخاطبان را مبهوت کرد و با دامنه پویا و عمق احساسی‌اش تأثیر گذاشت.",
                    "difficulty": 3,
                    "last_time_reviewed": "2025-02-06 00:22:42"
                }
            ]
        },
        {
            "word": "benighted",
            "examples": [
                {
                    "english": "The benighted policies of the regime stifled intellectual freedom, leaving the population deprived of education and critical thinking.",
                    "persian": "سیاست‌های جاهلانه رژیم، آزادی فکری را خفه کرد و جمعیت را از آموزش و تفکر انتقادی محروم ساخت.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-01-28 23:58:48"
                },
                {
                    "english": "In the benighted era before the scientific revolution, many natural phenomena were explained through superstition rather than empirical evidence.",
                    "persian": "در دوران جاهلانه قبل از انقلاب علمی، بسیاری از پدیده‌های طبیعی به جای شواهد تجربی، با خرافات توضیح داده می‌شدند.",
                    "difficulty": 2,
                    "last_time_reviewed": "2025-02-05 23:38:27"
                },
                {
                    "english": "The documentary shed light on the benighted conditions of rural communities, where access to modern technology and education remains severely limited.",
                    "persian": "مستند به شرایط جاهلانه جوامع روستایی پرداخت، جایی که دسترسی به فناوری مدرن و آموزش همچنان به شدت محدود است.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-01-28 23:56:11"
                },
                {
                    "english": "The philosopher argued that a society without the pursuit of knowledge is a benighted one, doomed to repeat the mistakes of the past.",
                    "persian": "فیلسوف استدلال کرد که جامعه‌ای که به دنبال دانش نباشد، جامعه‌ای جاهل است و محکوم به تکرار اشتباهات گذشته.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-05 23:58:00"
                },
                {
                    "english": "Despite the advancements in neighboring regions, the benighted village remained untouched by progress, clinging to outdated traditions and beliefs.",
                    "persian": "علیرغم پیشرفت‌ها در مناطق همسایه، روستای جاهلانه همچنان دست‌نخورده از پیشرفت باقی ماند و به سنت‌ها و باورهای منسوخ چسبیده بود.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-01-29 08:47:25"
                }
            ]
        },
        {
            "word": "galvanize",
            "examples": [
                {
                    "english": "The tragic event galvanized the community into action, inspiring countless volunteers to come together and support those in need.",
                    "persian": "اتفاق غم‌انگیز جامعه را به اقدام واداشت و الهام‌بخش داوطلبان بی‌شماری شد تا گرد هم آیند و از نیازمندان حمایت کنند.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-06 00:21:12"
                },
                {
                    "english": "The leader’s impassioned speech galvanized the nation, uniting people across political divides to work toward a common goal.",
                    "persian": "سخنرانی پرشور رهبر، ملت را به حرکت واداشت و مردم را فراتر از اختلافات سیاسی متحد کرد تا برای هدفی مشترک تلاش کنند.",
                    "difficulty": 3,
                    "last_time_reviewed": "2025-02-05 23:49:14"
                },
                {
                    "english": "The groundbreaking discovery galvanized the scientific community, prompting researchers worldwide to explore new avenues of innovation.",
                    "persian": "این کشف انقلابی، جامعه علمی را به حرکت واداشت و محققان در سراسر جهان را ترغیب کرد تا مسیرهای جدیدی برای نوآوری بررسی کنند.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-02-01 17:27:05"
                },
                {
                    "english": "The young activist’s courage galvanized her peers, encouraging them to speak out against injustice and demand change.",
                    "persian": "شجاعت فعال جوان، هم‌سن‌وسالانش را به حرکت واداشت و آن‌ها را تشویق کرد تا علیه بی‌عدالتی سخن بگویند و خواستار تغییر شوند.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-06 00:13:40"
                },
                {
                    "english": "The company’s commitment to sustainability galvanized its employees, motivating them to develop eco-friendly solutions and reduce their environmental impact.",
                    "persian": "تعهد شرکت به پایداری، کارکنانش را به حرکت واداشت و آن‌ها را ترغیب کرد تا راه‌حل‌های سازگار با محیط زیست توسعه دهند و تأثیرات محیطی خود را کاهش دهند.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-06 00:22:03"
                }
            ]
        },
        {
            "word": "hedge",
            "examples": [
                {
                    "english": "Investors often hedge their portfolios by diversifying assets, reducing the risk of significant losses during market downturns.",
                    "persian": "سرمایه‌گذاران اغلب با تنوع بخشیدن به دارایی‌ها، پرتفوی خود را پوشش می‌دهند تا خطر زیان‌های بزرگ در زمان رکود بازار را کاهش دهند.",
                    "difficulty": 3,
                    "last_time_reviewed": "2025-01-30 14:17:14"
                },
                {
                    "english": "The CEO hedged her remarks about the company’s future profitability, emphasizing that it depended on unpredictable market conditions.",
                    "persian": "مدیرعامل اظهارات خود درباره سودآوری آینده شرکت را محدود کرد و تأکید نمود که این موضوع به شرایط غیرقابل پیش‌بینی بازار بستگی دارد.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-06 00:13:10"
                },
                {
                    "english": "When asked about the controversial policy, the politician hedged, offering vague answers that avoided committing to a specific position.",
                    "persian": "وقتی درباره سیاست بحث‌برانگیز سؤال شد، سیاستمدار از دادن پاسخ مستقیم طفره رفت و جواب‌های مبهمی داد که از اتخاذ موضعی مشخص اجتناب می‌کرد.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-01-28 23:58:27"
                },
                {
                    "english": "To protect against currency fluctuations, the company decided to hedge its foreign investments using financial derivatives.",
                    "persian": "برای محافظت در برابر نوسانات ارزی، شرکت تصمیم گرفت سرمایه‌گذاری‌های خارجی خود را با استفاده از ابزارهای مالی مشتقه پوشش دهد.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-01-28 23:55:37"
                },
                {
                    "english": "The scientist hedged her conclusions in the research paper, noting that further studies were needed to confirm the findings.",
                    "persian": "دانشمند نتیجه‌گیری‌های خود در مقاله تحقیقاتی را محدود کرد و اشاره نمود که برای تأیید یافته‌ها به مطالعات بیشتری نیاز است.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-02-01 17:42:32"
                }
            ]
        },
        {
            "word": "flush",
            "examples": [
                {
                    "english": "Her cheeks flushed with embarrassment when she realized she had mispronounced the guest’s name in front of the entire audience.",
                    "persian": "گونه‌های او از خجالت سرخ شد وقتی متوجه شد که نام مهمان را در حضور تمام حضار اشتباه تلفظ کرده است.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-01-28 23:58:15"
                },
                {
                    "english": "The child’s face flushed with excitement as he unwrapped the gift, his eyes wide with joy.",
                    "persian": "صورت کودک از هیجان سرخ شد در حالی که هدیه را باز می‌کرد و چشمانش از شادی برق می‌زد.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-01-29 23:36:22"
                },
                {
                    "english": "He quickly flushed the incriminating documents down the toilet when he heard the authorities approaching.",
                    "persian": "او سریعاً اسناد جرم‌آلود را در توالت فرستاد وقتی شنید که مأموران در حال نزدیک شدن هستند.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-06 00:17:04"
                },
                {
                    "english": "The old medication was no longer needed, so she flushed it down the toilet to dispose of it safely.",
                    "persian": "داروی قدیمی دیگر مورد نیاز نبود، بنابراین آن را در توالت فرستاد تا به طور ایمن دور انداخته شود.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-04 12:37:36"
                },
                {
                    "english": "After the heavy rains, the rivers were flush with water, creating a breathtaking landscape.",
                    "persian": "پس از باران‌های سنگین، رودخانه‌ها پر از آب بودند و مناظر خیره‌کننده‌ای ایجاد کردند.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-01-28 23:52:22"
                },
                {
                    "english": "The startup was flush with cash after securing a major investment, allowing it to expand rapidly.",
                    "persian": "استارت‌آپ پس از جذب یک سرمایه‌گذاری بزرگ، پر از پول بود و این امکان را فراهم کرد تا به سرعت گسترش یابد.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-05 23:30:05"
                },
                {
                    "english": "The hunters used dogs to flush the pheasants out of the bushes, making them easier to spot.",
                    "persian": "شکارچیان از سگ‌ها استفاده کردند تا قرقاول‌ها را از میان بوته‌ها بیرون بکشند و پیدا کردن آن‌ها را آسان‌تر کنند.",
                    "difficulty": 3,
                    "last_time_reviewed": "2025-01-30 14:30:14"
                },
                {
                    "english": "The police operation was designed to flush the fugitives out of their hiding places and force them into the open.",
                    "persian": "عملیات پلیس طوری طراحی شده بود که فراری‌ها را از مخفیگاه‌هایشان بیرون بکشد و آن‌ها را به فضای باز بکشاند.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-01 17:37:17"
                }
            ]
        },
        {
            "word": "fell",
            "examples": [
                {
                    "english": "The fell sorcerer’s dark magic spread across the land, leaving destruction and despair in its wake.",
                    "persian": "جادوی تاریک جادوگر شیطانی در سراسر سرزمین گسترش یافت و ویرانی و ناامیدی را به جای گذاشت.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-01-30 14:45:55"
                },
                {
                    "english": "The king’s fell decree struck fear into the hearts of his subjects, as it demanded unquestioning obedience under threat of death.",
                    "persian": "فرمان شیطانی پادشاه ترس را در دل رعیت‌هایش انداخت، زیرا اطاعت بی‌چون‌وچرا را تحت تهدید مرگ مطالبه می‌کرد.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-06 00:14:29"
                },
                {
                    "english": "The novel’s antagonist is portrayed as a fell creature, embodying pure malice and wreaking havoc on all who crossed its path.",
                    "persian": "شخصیت منفی رمان به عنوان موجودی شیطانی به تصویر کشیده شده است که تجسم خالص شرارت بود و بر سر هر کسی که سر راهش قرار می‌گرفت، فاجعه به بار می‌آورد.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-05 23:03:11"
                },
                {
                    "english": "The historian described the tyrant’s reign as a fell chapter in the nation’s history, marked by cruelty and oppression.",
                    "persian": "تاریخ‌دان دوران حکومت مستبد را به عنوان فصلی شیطانی در تاریخ کشور توصیف کرد که با ظلم و ستم مشخص می‌شد.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-06 00:24:39"
                },
                {
                    "english": "The villagers spoke in hushed tones of the fell spirit that haunted the forest, warning travelers to avoid the area after dark.",
                    "persian": "روستاییان با لحنی آهسته از روح شیطانی که جنگل را تسخیر کرده بود صحبت می‌کردند و به مسافران هشدار می‌دادند که پس از تاریکی هوا از آن منطقه دوری کنند.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-01-28 23:54:18"
                }
            ]
        },
        {
            "word": "arch",
            "examples": [
                {
                    "english": "With an arch smile, she remarked, 'I suppose you think you're the only one who can solve this problem,' leaving him both amused and slightly annoyed.",
                    "persian": "با لبخندی طعنه‌آمیز گفت: «فکر می‌کنم تنها کسی هستی که می‌توانی این مشکل را حل کنی»، و او را هم سرگرم و کمی آزارده کرد.",
                    "difficulty": 2,
                    "last_time_reviewed": "2025-02-04 14:30:45"
                },
                {
                    "english": "His arch tone during the debate suggested he found his opponent’s arguments more amusing than convincing, much to the latter’s irritation.",
                    "persian": "لحن طعنه‌آمیز او در طول مناظره نشان می‌داد که استدلال‌های حریفش را بیشتر سرگرم‌کننده تا قانع‌کننده می‌دانست، که این موضوع باعث ناراحتی حریف شد.",
                    "difficulty": 2,
                    "last_time_reviewed": "2025-02-06 00:20:13"
                },
                {
                    "english": "She gave him an arch look and said, 'Oh, so now you’re an expert on everything?' clearly poking fun at his tendency to overexplain.",
                    "persian": "با نگاهی طعنه‌آمیز به او گفت: «آه، پس حالا تو در همه چیز متخصصی؟» و به وضوح به تمایل او به توضیح بیش از حد خرده می‌گرفت.",
                    "difficulty": 2,
                    "last_time_reviewed": "2025-02-05 23:30:27"
                },
                {
                    "english": "The author’s arch humor throughout the novel kept readers entertained, as she playfully mocked societal norms and pretensions.",
                    "persian": "طنز طعنه‌آمیز نویسنده در سراسر رمان خوانندگان را سرگرم نگه می‌داشت، زیرا او به شیوه‌ای شوخ‌طبعانه هنجارها و تظاهرهای اجتماعی را مسخره می‌کرد.",
                    "difficulty": 2,
                    "last_time_reviewed": "2025-01-30 14:58:53"
                },
                {
                    "english": "His arch comment, 'Well, aren’t we just full of surprises today?' was met with a mix of laughter and eye-rolls from the group.",
                    "persian": "اظهار طعنه‌آمیز او، «خب، امروز پر از سورپرایز نیستیم؟» با ترکیبی از خنده و چشم‌غره از سوی گروه مواجه شد.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-02-01 17:43:42"
                }
            ]
        },
        {
            "word": "beg",
            "examples": [
                {
                    "english": "When asked about the scandal, the politician cleverly begged the question, redirecting the conversation to his recent policy achievements.",
                    "persian": "وقتی درباره رسوایی از او سؤال شد، سیاستمدار به طور ماهرانه از پاسخ طفره رفت و گفتگو را به دستاوردهای اخیرش در زمینه سیاست‌ها معطوف کرد.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-02-04 12:14:09"
                },
                {
                    "english": "The CEO’s response seemed to beg the question, as he avoided addressing the allegations directly and instead spoke in vague generalities.",
                    "persian": "پاسخ مدیرعامل به نظر می‌رسید که از پاسخ طفره می‌رود، زیرا او از پرداختن مستقیم به اتهامات اجتناب کرد و به جای آن به کلی‌گویی‌های مبهم پرداخت.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-01-28 23:57:00"
                },
                {
                    "english": "During the press conference, the spokesperson repeatedly begged the question, frustrating journalists who sought clear answers.",
                    "persian": "در طول کنفرانس مطبوعاتی، سخنگو بارها از پاسخ طفره رفت و روزنامه‌نگارانی را که به دنبال پاسخ‌های روشن بودند، ناامید کرد.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-01-28 23:56:51"
                },
                {
                    "english": "Her attempt to beg the question by changing the subject only made it more obvious that she was hiding something.",
                    "persian": "تلاش او برای طفره رفتن از سؤال با تغییر موضوع، فقط این را واضح‌تر کرد که او چیزی را پنهان می‌کند.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-01-28 23:56:44"
                },
                {
                    "english": "The professor noticed the student’s effort to beg the question during the oral exam and gently steered the conversation back to the original topic.",
                    "persian": "استاد متوجه تلاش دانشجو برای طفره رفتن از سؤال در طول امتحان شفاهی شد و به آرامی گفتگو را به موضوع اصلی بازگرداند.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-05 23:57:58"
                }
            ]
        },
        {
            "word": "tender",
            "examples": [
                {
                    "english": "The company decided to tender its resignation from the industry consortium, citing irreconcilable differences in strategic vision.",
                    "persian": "شرکت تصمیم گرفت استعفای خود را از اتحادیه صنعتی ارائه دهد و به اختلافات آشتی‌ناپذیر در دیدگاه استراتژیک اشاره کرد.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-05 23:59:39"
                },
                {
                    "english": "He tendered his apology with genuine remorse, hoping to mend the strained relationship with his colleagues.",
                    "perslation": "او عذرخواهی خود را با پشیمانی واقعی ارائه داد و امیدوار بود که رابطه پرتنش با همکارانش را ترمیم کند.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-06 00:07:59"
                },
                {
                    "english": "The artist tendered her latest masterpiece to the gallery, eager to share her work with a broader audience.",
                    "persian": "هنرمند آخرین شاهکار خود را به گالری ارائه داد و مشتاق بود که اثرش را با مخاطبان گسترده‌تری به اشتراک بگذارد.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-01-28 22:26:11"
                },
                {
                    "english": "The diplomat tendered a proposal for peace negotiations, urging both sides to come to the table and resolve the conflict.",
                    "persian": "دیپلمات پیشنهادی برای مذاکرات صلح ارائه داد و از هر دو طرف خواست تا به میز مذاکره بیایند و اختلاف را حل کنند.",
                    "difficulty": 0,
                    "last_time_reviewed": "2025-01-29 08:44:35"
                },
                {
                    "english": "She tendered her resignation letter to the board, expressing gratitude for the opportunities she had been given but acknowledging it was time to move on.",
                    "persian": "او نامه استعفای خود را به هیئت مدیره ارائه داد و قدردانی خود را از فرصت‌هایی که به او داده شده بود بیان کرد، اما اذعان داشت که زمان حرکت به جلو فرا رسیده است.",
                    "difficulty": 1,
                    "last_time_reviewed": "2025-02-04 15:44:49"
                }
            ]
        }
    ]
}